<script setup lang="ts">
import person from '@/components/block3person/person.vue';
</script>

<template>
<div class="redactor_persons_block"> 
    <div class="title">
        <div>
            <h2>
                Делаем все для того, чтобы вы остались довольны нашей тканью
            </h2>
        </div>
        <div class="btn_title_person">
            <button>OOO</button>
        </div>
    </div>
<div class="full_blocks_person">
    <div class="Container-Block">
        <person 
        text="Повседневная практика показывает, что современная методология разработки способствует повышению качества благоприятных перспектив. Наше дело не так однозначно, как может показаться: высокое качество позиционных исследований не даёт нам иного выбора, кроме определения глубокомысленных рассуждений. Являясь всего лишь частью общей картины, акционеры крупнейших компаний, превозмогая сложившуюся непростую экономическую ситуацию, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу."
        name="Наталья"
        />
    </div>
    <div class="Container-Block">
        <person 
        text="Повседневная практика показывает, что современная методология разработки способствует повышению качества благоприятных перспектив. Наше дело не так однозначно, как может показаться: высокое качество позиционных исследований не даёт нам иного выбора, кроме определения глубокомысленных рассуждений. Являясь всего лишь частью общей картины, акционеры крупнейших компаний, превозмогая сложившуюся непростую экономическую ситуацию"
        name="Василий"
        />
    </div>
    <div class="Container-Block">
        <person 
        text="Повседневная практика показывает, что современная методология разработки способствует повышению качества благоприятных перспектив. Наше дело не так однозначно, как может показаться: высокое качество позиционных исследований не даёт нам иного выбора, кроме определения глубокомысленных рассуждений. "
        name="Геннадий"
        />
    </div>
</div>
</div>
</template>

<style setup lang="scss">
    .redactor_persons_block {
        display: flex;
        flex-direction: column;
    }

    .full_blocks_person {
        display: flex;
        flex-direction: row;
        padding: 40px 0px;
    }
</style>